Repository: sugarlabs/getiabooks
Catalog: po/*.po
Languages: he

source: Get IA Books
he: הורדת ספרים מארכיון האינטרנט

source: Download thousands of free e-books in PDF, DejaVu, and EPUB formats from the Internet Archive!
he: הורדת אלפי ספרים אלקטרוניים בחינם בתצורות PDF,‏ DejaVu ו־ePub מארכיון האינטרנט!

source: Get Book
he: הורדת ספר

source: Enter words from the Author or Title to begin search
he: נא להזין מילים מהכותרת או משם המחבר כדי להתחיל בחיפוש

source: Title
he: כותרת

source: Volume
he: כרך

source: Author
he: מחבר

source: Language
he: שפה

source: Books
he: ספרים

source: Subject
he: נושא

source: Publisher
he: הוצאה לאור

source: Download URL
he: כתובת להורדה

source: Performing lookup, please wait
he: החיפוש מתבצע, נא להמתין

source: Error
he: שגיאה

source: You must enter at least one search word.
he: עליך להזין מילת חיפוש אחת לפחות.

source: Connection timed out for CSV:
he: זמן החיבור פג עבור CSV:

source: Error getting CSV
he: קבלת ה־CSV נכשלה

source: Finished
he: הסתיים

source: Connection timed out for
he: זמן החיבור פג עבור

source: Could not download
he: לא ניתן להוריד

source: path in catalog is incorrect. If you tried to download B/W PDF try another format.
he: הנתיב בקטלוג שגוי. אם ניסית להוריד PDF בשחור לבן, נא לנסות סוג קובץ אחר.

source: Success
he: הצלחה

source: added to Journal.
he: נוסף ליומן.
