Repository: sugarlabs/getiabooks
Catalog: po/ach.po
Languages: ach

source: Get IA Books
ach: Kwany IA Buke

source: Download thousands of free e-books in PDF, DejaVu, and EPUB formats from the Internet Archive!
ach: Kwany ikan okano iye i Net e-buke me nono ame romo tutumia apol ata ikwone me PDF, DejaVu, kede EPUB!

source: Get Book
ach: Nwong Buk

source: Enter words from the Author or Title to begin search
ach: Co kop ame tye inying aco buk onyo en ame tye inying buk wek icaki yenyo

source: Title
ach: Nying buk

source: Volume
ach: Rwom abuk

source: Author
ach: Aco buk

source: Language
ach: Leb

source: Books
ach: Buke

source: Subject
ach: Lok ikom

source: Publisher
ach: Layiki

source: Download URL
ach: Kwany i net URL

source: Performing lookup, please wait
ach: Tye atute me yenyo, tim ber ikuri

source: Error
ach: Bal

source: You must enter at least one search word.
ach: Myero iketi lok acel moro ame itye kayenyo.

source: Connection timed out for CSV:
ach: Cawa me kubere otyeko tum oko pi CSV:

source: Error getting CSV
ach: Bal inwongo CSV

source: Finished
ach: Otyeko tum

source: Connection timed out for
ach: Kubere okwanyo oko pi

source: Could not download
ach: Pe romo kwanyo i Net

source: Success
ach: Otum aber

source: added to Journal.
ach: omedo iJanol.
